var
  D,M:Integer;
begin
  Write('Введите число: ');
  Readln(D);
  Write('Введите месяц: ');
  Readln(M);
  Case D of
   1:   Write('первое ');
   2:   Write('второе ');
   3:   Write('третье ');
   4:   Write('четвертое ');
   5:   Write('пятое ');
   6:   Write('шестое ');
   7:   Write('седьмое ');
   8:   Write('восьмое ');
   9:   Write('девятое ');
   10:   Write('десятое ');
   11:   Write('одиннадцатое ');
   12:   Write('двенадцатое ');
   13:   Write('тринадцатое ');
   14:   Write('четырнадцатое ');
   15:   Write('пятнадцатое ');
   16:   Write('шестнадцатое ');
   17:   Write('семнадцатое ');
   18:   Write('восемнадцатое ');
   19:   Write('девятнадцатое ');
   20:   Write('двадцатое ');
   21:   Write('двадцать первое ');
   22:   Write('двадцать второе ');
   23:   Write('двадцать третье ');
   24:   Write('двадцать четвертое ');
   25:   Write('двадцать пятое ');
   26:   Write('двадцать шестое ');
   27:   Write('двадцать седьмое ');
   28:   Write('двадцать восьмое ');   
   29:   Write('двадцать девятое ');
   30:   Write('тридцатое ');
   31:   Write('тридцать первое ');
  end;
  Case M of
   1:   Writeln('января');
   2:   Writeln('февраля');
   3:   Writeln('марта');
   4:   Writeln('апреля');
   5:   Writeln('мая');
   6:   Writeln('июня');
   7:   Writeln('июля');
   8:   Writeln('августа');
   9:   Writeln('сентября');
   10:   Writeln('окрября');
   11:   Writeln('ноября');
   12:   Writeln('декабря');
  end;
end.