var
  N:Integer;
begin
  Write('введите кол-во: ');
  Readln(N);
  if (N div 10) = 1 then
  begin
   case N of
     10:write('десять учебных заданий. ');
     11:write('одинадцать учебных заданий.');
     12:write('двенадцать учебных заданий.');
     13:write('тринадцать учебных заданий.');
     14:write('четырнадцать учебных заданий.');
     15:write('пятнадцать учебных заданий.');
     16:write('шестнадцать учебных заданий.');
     17:write('семнадцать учебных заданий.');
     18:write('восемнадцать учебных заданий.');
     19:write('девятнадцать учебных заданий.');
 
    end;
  end
  else
   begin
    case N div 10 of
     2:write('двадцать ');
     3:write('тридцать ');
     4:write('сорок ');
    end;
 
    case N mod 10 of
     1:write('одно ');
     2:write('два ');
     3:write('три ');
     4:write('четыре ');
     5:write('пять ');
     6:write('шесть ');
     7:write('семь ');
     8:write('восемь ');
     9:write('девять ');
    end;
 
    case N mod 10 of
     0,5,6,7,8,9:write('учебных заданий.');
     1:write('учебное задание.');
     2,3,4:write('учебных задания.');
    end;
   end;
end.